package ru.oktemsec.audioguide

class Repository {
    val expositionsList: List<Exposition> = listOf(
        Exposition(R.string.zal_istoria_obraz, R.drawable.zal_istoria_obraz, "Экспозиция раскрывает становление и развитие системы образования в Хангаласском улусе, начиная с 1874 г. Об известных деятелях образования, становление школьного и дошкольного образования, педагогические династии улуса, история улусного управления образования и др. Выставлена также подборка книг об учителях и отдельных школах улуса и выставка технических средств обучения. Здесь также представлена история развития системы дополнительного образования и пионерского движения. Один из основных стендов посвящен педагогическим династиям Хангаласского улуса."),
        Exposition(R.string.zal_alex_narod, R.drawable.zal_alex_narod, "Экспозиция музея образования Хангаласского улуса открывается залом, посвященным деятельности Алексеевского народного училища (1874-1917гг). Здесь представлены копии фотографий, архивных документов, отчетов училища, газетных статей, свидетельствующих о деятельности народных учителей и сведения о выпускниках училища того времени. Среди экспонатов есть фотографии, архивные документы и сведения о первом учителе нашего улуса Неустроеве В.Г., о Широких А.Д.- общественно-политическом и государственном деятеле, благодаря которому построено в 1914 г. здание школы, в котором находится музей. Интересным документом является выдержка из статьи А. Линькова «Деятели по народному образованию» (журнал «Сибирский архив»), в котором указана дата открытия первой школы улуса – 6 января 1874 г. в 11ч. утра в здании, построенном на средства «…инородца Ивана Павлова» из Одунинского наслега."),
        Exposition(R.string.zal_class_soviet, R.drawable.zal_class_soviet, ""),
        Exposition(R.string.zal_school_in_soviet, R.drawable.zal_school_in_soviet, ""),
        Exposition(R.string.zal_new_history_school, R.drawable.zal_new_history_school, ""),
        Exposition(R.string.zal_kraeved_ugolok, R.drawable.zal_kraeved_ugolok, ""),
    )
}